
pub const KEYWORDS:[&str; 82] = [
    "if",       "若",
    "else",     "否则",
    "while",    "当",
    "loop",     "循环",
    "foreach",  "迭代",
    "continue", "跳过",
    "break",    "中止",
    "bool",     "逻辑",
    "true",     "真",
    "false",    "假",
    "and",      "且",
    "or",       "或",
    "int",      "整数",
    "float",    "有理数",
    "string",   "字符",
    "array",    "数组",
    "let",      "令",
    "class",    "模型",
    "trait",    "特征",
    "fn",       "函数",
    "pub",      "公开",
    "use",      "引入",
    "return",   "返回",

    "//",   "/*",   "*/",
    "\"",
    "'",
    "『",   "』",
    "「",   "」",
    "(",    ")",
    "[",    "]",
    "{",    "}",
    ".",
    "+", "-", "*", "/", "%",
    "=", ">", "<", ">=", "<=", "==",
    "->", "=>",
    ":",
    "&",
    "&&", "||", "!",
    ",", "\\"
    ];

// 中止符 禁止在标识符中出现
pub const STOP_CHARS:[char; 28] = [
    ',', '.',                                  // 分隔符禁止出现
    '\'', '"', '「', '」', '『',   '』',        // 字符串起始符禁止出现
    '+', '-', '*', '/', '%', '=',              // 数学符号禁止出现
    '(', ')', '[', ']', '{', '}',              // 括号禁止出现
    '&', '|', '!',                             // 逻辑符号禁止出现
    '\\', '\n', '\r', '\t', ' '                // 转义符及空格禁止出现
];

pub const SINGLE_CHARS:[char; 17] = [
    ',', '.',                                  // 分隔符禁止出现
    '\'', '"', '「', '」', '『',   '』',        // 字符串起始符禁止出现
    '+', '%',
    '(', ')', '[', ']', '{', '}',              // 括号禁止出现
    '!'
];

pub const SKIP_CHARS:[char; 4] = [
    ' ', '\n', '\r', '\t'
];